cuplsensor/cupltag/firmware/driverlib/MSP430FR2xx_4xx/cs.c
    // Enable DCO frequency trim
    HWREG16(CS_BASE + OFS_CSCTL1) |= DCOFTRIMEN;

    // Calculates DCO frequency trim values and stores them in struct pointer
    param->fsystem = fsystem;
    privateCSComputeDCOFTrim(param);
    
    while ((HWREG16(CS_BASE + OFS_CSCTL7) & (FLLUNLOCK0 | FLLUNLOCK1)) || 
        (HWREG8(CS_BASE + OFS_CSCTL7_L) & DCOFFG))
    {
        //Clear OSC fault flags
        HWREG8(CS_BASE + OFS_CSCTL7_L) &= ~(DCOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    // Restore previous SCG0
    __bis_SR_register(srRegisterState);
    
    while (x--)
    {
        __delay_cycles(30);
    }
    
    return status;
}

bool CS_initFLLLoadTrim(uint16_t fsystem,
    uint16_t ratio,
    CS_initFLLParam *param
    )
{
    if(param->fsystem != fsystem)
    {
        // Protection against wrong clock frequency and trim combination
        return false;
    }
    
    uint16_t dco_FLLN, dco_FLLD = FLLD__1;
    bool status = true;
    volatile uint16_t x = ratio * 32;

    //Save actual state of FLL loop control, then disable it. This is needed to
    //prevent the FLL from acting as we are making fundamental modifications to
    //the clock setup.
    uint16_t srRegisterState = __get_SR_register() & SCG0;

    //Have at least a divider of 2
    dco_FLLN = ratio;
    
    // Disable FLL
    __bis_SR_register(SCG0);
    
    //Set DCO to proper tap
    HWREG16(CS_BASE + OFS_CSCTL0) &= ~( DCO8 |
                                            DCO7 |
                                            DCO6 |
                                            DCO5 |
                                            DCO4 |
                                            DCO3 |
                                            DCO2 |
                                            DCO1 |
                                            DCO0
                                            );
    HWREG16(CS_BASE + OFS_CSCTL0) |= (param->csCtl0 & 
                                        (   DCO8 |
                                            DCO7 |
                                            DCO6 |
                                            DCO5 |
                                            DCO4 |
                                            DCO3 |
                                            DCO2 |
                                            DCO1 |
                                            DCO0
                                            ));

    //Reset FLLN bits
    HWREG16(CS_BASE + OFS_CSCTL2) &= ~( FLLN9 |
                                            FLLN8 |
                                            FLLN7 |
                                            FLLN6 |
                                            FLLN5 |
                                            FLLN4 |
                                            FLLN3 |
                                            FLLN2 |
                                            FLLN1 |
                                            FLLN0
                                        );
    HWREG16(CS_BASE + OFS_CSCTL2) = dco_FLLD | (dco_FLLN - 1);
    
    // Set proper DCORSEL value
    HWREG8(CS_BASE + OFS_CSCTL1) &= ~DCORSEL_7;
    if (fsystem <= 1000){           //fsystem <= 1MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_0;
    }
    else if (fsystem <=  2000){      //1MHz < fsystem <= 2MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_1;
    }
    else if (fsystem <=  4000){      //2MHz < fsystem <=  4MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_2;
    }
    else if (fsystem <=  8000){      //4MHz  < fsystem <=  8MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_3;
    }
    else if (fsystem <=  12000){     //8MHz    < fsystem <= 12MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_4;
    }
    else if (fsystem <=  16000){     //12MHz   < fsystem <=  16MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_5;
    }
    else if (fsystem <=  20000){     //16MHz   < fsystem <= 20MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_6;
    }
    else if (fsystem <=  24000){     //20MHz   < fsystem <=  24MHz
        HWREG8(CS_BASE + OFS_CSCTL1) |= DCORSEL_7;
    }
    else {
    	//exceeds 24MHz, not supported
    	status = false;
    }
    
    // Enable DCO frequency trim
    HWREG16(CS_BASE + OFS_CSCTL1) |= DCOFTRIMEN;
    
    // Set proper DCOFTRIM value
    HWREG16(CS_BASE + OFS_CSCTL1) &= ~(DCOFTRIM0 | DCOFTRIM1 | DCOFTRIM2);
    HWREG16(CS_BASE + OFS_CSCTL1) |= (param->csCtl1 & (DCOFTRIM0 | DCOFTRIM1 | DCOFTRIM2));

    // Re-enable FLL
    __bic_SR_register(SCG0);
    
    while ((HWREG16(CS_BASE + OFS_CSCTL7) & (FLLUNLOCK0 | FLLUNLOCK1)) || 
        (HWREG8(CS_BASE + OFS_CSCTL7_L) & DCOFFG))
    {
        //Clear OSC fault flags
        HWREG8(CS_BASE + OFS_CSCTL7_L) &= ~(DCOFFG);

        //Clear OFIFG fault flag
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    // Restore previous SCG0
    __bis_SR_register(srRegisterState);
    
    while (x--)
    {
        __delay_cycles(30);
    }
    
    return status;
}

void CS_enableClockRequest(uint8_t selectClock
    )
{
    HWREG8(CS_BASE + OFS_CSCTL8) |= selectClock;
}

void CS_disableClockRequest(uint8_t selectClock
    )
{
    HWREG8(CS_BASE + OFS_CSCTL8) &= ~selectClock;
}

uint8_t CS_getFaultFlagStatus(uint8_t mask
    )
{
    return (HWREG8(CS_BASE + OFS_CSCTL7) & mask);
}

void CS_clearFaultFlag(uint8_t mask
    )
{
    HWREG8(CS_BASE + OFS_CSCTL7) &= ~mask;
}

uint32_t CS_getACLK(void)
{
    //Find ACLK source
    uint16_t ACLKSource = (HWREG16(CS_BASE + OFS_CSCTL4) & SELA);

    ACLKSource = ACLKSource >> 8;

    if (ACLKSource == 0x0) {
    	ACLKSource = SELMS__XT1CLK;
    }
    else if (ACLKSource == 0x1) {
        ACLKSource = SELMS__REFOCLK;
    }
    else {
        ACLKSource = SELMS__VLOCLK;
    }

    uint16_t ACLKSourceDivider = 0;
#ifdef DIVA0
    if (HWREG16(CS_BASE + OFS_CSCTL6) & XTS) {

        uint16_t div = (HWREG16(CS_BASE + OFS_CSCTL6) &
                (DIVA0|DIVA1|DIVA2|DIVA3)) >>8;
        switch(div) {
        case 1:
        case 2:
        case 3:
        case 4:
        case 5:
            ACLKSourceDivider = 8*(1<<div);
            break;
        case 6:
            ACLKSourceDivider = 384;
            break;
        case 7:
            ACLKSourceDivider = 512;
            break;
        case 8:
            ACLKSourceDivider = 768;
            break;
        case 9:
            ACLKSourceDivider = 1024;
            break;
        case 10:
            ACLKSourceDivider = 108;
            break;
        case 11:
            ACLKSourceDivider = 338;
            break;
        case 12:
            ACLKSourceDivider = 414;
            break;
        case 13:
            ACLKSourceDivider = 640;
            break;
        default:
            break;
        }
    }
#endif
    return (privateCSComputeCLKFrequency( 
            ACLKSource, 
            ACLKSourceDivider,
            CS_ACLK)
            );
}

uint32_t CS_getSMCLK(void)
{
    uint16_t SMCLKSource = HWREG8(CS_BASE + OFS_CSCTL4_L) & SELMS_7;

    uint16_t SMCLKSourceDivider =
        HWREG16(CS_BASE + OFS_CSCTL5) & DIVS_3;
    SMCLKSourceDivider = SMCLKSourceDivider >> 4;

    return (privateCSComputeCLKFrequency(
                SMCLKSource,
                SMCLKSourceDivider,
                CS_SMCLK)
            );
}

uint32_t CS_getMCLK(void)
{
    //Find AMCLK source
    uint16_t MCLKSource = (HWREG16(CS_BASE + OFS_CSCTL4) & SELMS_7);

    uint16_t MCLKSourceDivider =  HWREG16(CS_BASE + OFS_CSCTL5) & DIVM_7;

    return (privateCSComputeCLKFrequency(
                MCLKSource,
                MCLKSourceDivider,
                CS_MCLK)
            );
}

uint16_t CS_clearAllOscFlagsWithTimeout( uint16_t timeout){
    do {
      // Clear all osc fault flags
      HWREG8(CS_BASE + OFS_CSCTL7) &= ~(DCOFFG | XT1OFFG);

      // Clear the global osc fault flag.
      HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
      
      // Check XT1 fault flags
    } while ((HWREG8(SFR_BASE + OFS_SFRIFG1) & OFIFG) && --timeout);                   

    return (HWREG8(CS_BASE + OFS_CSCTL7) & (DCOFFG | XT1OFFG));
}

void CS_enableXT1AutomaticGainControl(void)
{
    HWREG16(CS_BASE + OFS_CSCTL6) &= ~XT1AGCOFF;
}

void CS_disableXT1AutomaticGainControl(void)
{
    HWREG16(CS_BASE + OFS_CSCTL6) |= XT1AGCOFF;
}

void CS_enableFLLUnlock(void)
{
	HWREG16(CS_BASE + OFS_CSCTL7) |= FLLULPUC;
}

void CS_disableFLLUnlock(void)
{
	HWREG16(CS_BASE + OFS_CSCTL7) &= ~FLLULPUC;
}

void CS_enableREFOLP(void)
{
#ifdef REFOLP
    HWREG16(CS_BASE + OFS_CSCTL3) |= REFOLP;
#endif
}

void CS_disableREFOLP(void)
{
#ifdef REFOLP
    HWREG16(CS_BASE + OFS_CSCTL3) &= ~REFOLP;
#endif
}

bool CS_getREFOLP(void)
{
#ifdef REFOLP
    return ((HWREG16(CS_BASE + OFS_CSCTL3) & REFOLP) ? true : false);
#else
    return false;
#endif
}

void CS_enableXT1FaultOff(void)
{
#ifdef XT1FAULTOFF
    HWREG16(CS_BASE + OFS_CSCTL6) |= XT1FAULTOFF;
#endif
}

void CS_disableXT1FaultOff(void)
{
#ifdef XT1FAULTOFF
    HWREG16(CS_BASE + OFS_CSCTL6) &= ~XT1FAULTOFF;
#endif
}

bool CS_getXT1FaultOff(void)
{
#ifdef XT1FAULTOFF
    return ((HWREG16(CS_BASE + OFS_CSCTL6) & XT1FAULTOFF) ? true : false);
#else
    return false;
#endif
}

bool CS_getREFOReady(void)
{
#ifdef REFOREADY
    return ((HWREG16(CS_BASE + OFS_CSCTL7) & REFOREADY) ? true : false);
#else
    return false;
#endif
}

#endif
//*****************************************************************************
//
//! Close the doxygen group for cs_api
//! @}
//
//*****************************************************************************
